#### Alarm Terraform Plan 📖
```
module.api.data.archive_file.delete-function-zip: Reading...
module.api.data.archive_file.update-function-zip: Reading...
module.api.data.archive_file.update-layer-zip: Reading...
module.alarm-trigger.data.archive_file.trigger-function-zip: Reading...
module.api.data.archive_file.create-function-zip: Reading...
module.delete-failed-alarms.data.archive_file.delete-failed-alarms-function-zip: Reading...
module.api.data.archive_file.update-function-zip: Read complete after 0s [id=7e213fd57809e97b0c83eb4f2e2c0433c4fd7bb8]
module.api.data.archive_file.delete-function-zip: Read complete after 0s [id=f68ff486434550fb419471c943d13980b1d106ff]
module.delete-failed-alarms.data.archive_file.delete-failed-alarms-layer-zip: Reading...
module.alarm-trigger.data.archive_file.trigger-function-zip: Read complete after 0s [id=626b43679f3a6a90bf658a99bed3634aef175599]
module.alarm-trigger.data.archive_file.trigger-layer-zip: Reading...
module.delete-failed-alarms.data.archive_file.delete-failed-alarms-function-zip: Read complete after 0s [id=43bf908c2c33b6d87bec27329d1f19fc11a3a181]
module.api.data.archive_file.create-function-zip: Read complete after 0s [id=551ee35b11285d9e6532389d3cd18eca04a7c8ec]
module.api.data.archive_file.delete-layer-zip: Reading...
module.api.data.archive_file.create-layer-zip: Reading...
module.api.aws_scheduler_schedule_group.throwtrash-alarm-schedule-group: Refreshing state... [id=throwtrash-alarm-schedule-group]
module.delete-failed-alarms.aws_cloudwatch_log_group.throwtrash-alarm-delete-log-group: Refreshing state... [id=/aws/lambda/throwtrash-alarm-delete-failed-alarms]
module.api.data.aws_caller_identity.current: Reading...
module.api.aws_api_gateway_api_key.api-key-dev: Refreshing state... [id=mtw89qlbs2]
module.api.aws_dynamodb_table.throwtrash-alarm-table: Refreshing state... [id=throwtrash-alarm]
module.api.data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
module.api.aws_cloudwatch_log_group.throwtrash-alarm-log-group: Refreshing state... [id=/aws/lambda/throwtrash-alarm]
module.api-gateway-prod-stage[0].aws_api_gateway_api_key.api-key-prod-v2: Refreshing state... [id=hiry9xjdzl]
module.alarm-trigger.aws_cloudwatch_log_group.throwtrash-alarm-trigger-log-group: Refreshing state... [id=/aws/lambda/throwtrash-alarm-trigger]
module.api-gateway-prod-stage[0].aws_api_gateway_domain_name.api-domain-name: Refreshing state... [id=alarm.mythrowaway.net]
data.aws_caller_identity.current: Reading...
module.alarm-trigger.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.alarm-trigger.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.delete-failed-alarms.aws_sqs_queue.alarm_delete_queue_deadletter: Refreshing state... [id=https://sqs.ap-northeast-1.amazonaws.com/188970983837/throwtrash-alarm-delete-failed-alarms-queue-deadletter]
data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
module.api-gateway-prod-stage[0].aws_api_gateway_api_key.api-key-prod-v1: Refreshing state... [id=4rkujey9ml]
module.delete-failed-alarms.data.aws_caller_identity.current: Reading...
module.alarm-trigger.data.aws_caller_identity.current: Reading...
module.delete-failed-alarms.data.aws_region.current: Reading...
module.delete-failed-alarms.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.api.aws_api_gateway_rest_api.api: Refreshing state... [id=ylt5sxzsod]
module.delete-failed-alarms.data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
module.alarm-trigger.data.aws_region.current: Reading...
module.alarm-trigger.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.api.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.api.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.api.data.aws_iam_policy_document.scheduler-assume-role-policy: Reading...
module.api.data.aws_iam_policy_document.scheduler-assume-role-policy: Read complete after 0s [id=52247394]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.api.data.aws_region.current: Reading...
module.api.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.delete-failed-alarms.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.delete-failed-alarms.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.api-gateway-prod-stage[0].aws_route53_record.route53-record: Refreshing state... [id=Z5UYE2IX50J9A_alarm.mythrowaway.net_A]
module.alarm-trigger.aws_iam_role.throwtrash-alarm-trigger-lambda-role: Refreshing state... [id=throwtrash-alarm-trigger-lambda-role]
module.alarm-trigger.data.aws_caller_identity.current: Read complete after 1s [id=188970983837]
module.api.aws_iam_role.throwtrash-alarm-lambda-role: Refreshing state... [id=throwtrash-alarm-lambda-role]
module.api.aws_iam_role.throwtrash-alarm-scheduler-role: Refreshing state... [id=throwtrash-alarm-scheduler-role]
module.delete-failed-alarms.aws_iam_role.throwtrash-alarm-delete-lambda-role: Refreshing state... [id=throwtrash-alarm-delete-failed-alarms-lambda-role]
module.api.aws_iam_policy.throwtrash-alarm-lambda-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-lambda-policy]
module.api.aws_api_gateway_resource.api-resource-delete: Refreshing state... [id=nkks0s]
module.api.aws_api_gateway_resource.api-resource-update: Refreshing state... [id=k5ktnr]
module.api.aws_api_gateway_resource.api-resource-create: Refreshing state... [id=wipuw0]
module.api.aws_iam_role_policy_attachment.lambda-policy-attachment: Refreshing state... [id=throwtrash-alarm-lambda-role-20240429132809078300000002]
module.api.aws_api_gateway_method.api-method-delete: Refreshing state... [id=agm-ylt5sxzsod-nkks0s-DELETE]
module.api.aws_api_gateway_method.api-method-put: Refreshing state... [id=agm-ylt5sxzsod-k5ktnr-PUT]
module.api.aws_api_gateway_method.api-method-post: Refreshing state... [id=agm-ylt5sxzsod-wipuw0-POST]
module.delete-failed-alarms.aws_sqs_queue.alarm_delete_queue: Refreshing state... [id=https://sqs.ap-northeast-1.amazonaws.com/188970983837/throwtrash-alarm-delete-failed-alarms-queue]
module.api-gateway-prod-stage[0].aws_api_gateway_deployment.api-deployment-prod: Refreshing state... [id=uuaip0]
module.api-gateway-prod-stage[0].aws_api_gateway_stage.api-stage-prod-v1: Refreshing state... [id=ags-ylt5sxzsod-v1]
module.api-gateway-prod-stage[0].aws_api_gateway_stage.api-stage-prod-v2: Refreshing state... [id=ags-ylt5sxzsod-v2]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-update-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:v1]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan.usage-plan-prod-v1: Refreshing state... [id=u56dai]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-create-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:v1]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-delete-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:v1]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan.usage-plan-prod-v2: Refreshing state... [id=78fkm7]
module.api.data.archive_file.update-layer-zip: Read complete after 4s [id=60f5eaf000471a8de4f5fb20eac3033ce51d2915]
module.api-gateway-prod-stage[0].aws_api_gateway_base_path_mapping.api-base-path-mapping-v2: Refreshing state... [id=alarm.mythrowaway.net/v2]
module.api.data.archive_file.create-layer-zip: Read complete after 4s [id=ef067e6028eaa7c30183236c033be99cf3b80fc7]
module.api.aws_lambda_layer_version.throwtrash-alarm-update-layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-update-libs:2]
module.api.aws_lambda_layer_version.throwtrash-alarm-create-layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-create-libs:2]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan_key.api-plan-key-prod-v1: Refreshing state... [id=4rkujey9ml]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan_key.api-plan-key-prod-v2: Refreshing state... [id=hiry9xjdzl]
module.api.data.archive_file.delete-layer-zip: Read complete after 4s [id=84a56c1422bc2349fe9f31579b14f29a11ac9475]
module.api.aws_lambda_layer_version.throwtrash-alarm-delete-layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-delete-libs:2]
module.api.aws_lambda_function.throwtrash-alarm-delete-lambda: Refreshing state... [id=throwtrash-alarm-delete]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-create-permission-apigw-v1: Refreshing state... [id=terraform-20240502175439018500000002]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-update-permission-apigw-v1: Refreshing state... [id=terraform-20240502175439070600000003]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-delete-permission-apigw-v1: Refreshing state... [id=terraform-20240502175438382900000001]
module.api.aws_api_gateway_integration.api-integration-delete: Refreshing state... [id=agi-ylt5sxzsod-nkks0s-DELETE]
module.api.aws_lambda_alias.throwtrash-delete-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:dev]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-delete-alias-v2: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:v2]
module.alarm-trigger.data.archive_file.trigger-layer-zip: Read complete after 6s [id=d3ad43534801267fa5f4596b2a796e7b6d6637c5]
module.alarm-trigger.aws_lambda_layer_version.throwtrash-alarm-trigger-layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-trigger-libs:2]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-delete-permission-apigw-v2: Refreshing state... [id=terraform-20260301070524801500000001]
module.api.aws_lambda_permission.throwtrash-delete-permission-apigw: Refreshing state... [id=terraform-20240429131802029300000004]
module.delete-failed-alarms.data.archive_file.delete-failed-alarms-layer-zip: Read complete after 6s [id=ddd3d57063b5858c53222eb2ee15f98f8addfb6d]
module.delete-failed-alarms.aws_lambda_layer_version.throwtrash-alarm-delete-failed-alarms-layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-delete-failed-alarms-libs:2]
module.alarm-trigger.aws_lambda_function.throwtrash-alarm-trigger-lambda: Refreshing state... [id=throwtrash-alarm-trigger]
module.delete-failed-alarms.aws_lambda_function.throwtrash-alarm-delete-lambda: Refreshing state... [id=throwtrash-alarm-delete-failed-alarms]
module.api.aws_iam_policy.throwtrash-alarm-scheduler-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-scheduler-policy]
module.alarm-trigger.aws_lambda_function_event_invoke_config.throwtrash-alarm-trigger-lambda-event-invoke-config: Refreshing state... [id=throwtrash-alarm-trigger]
module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-prod[0]: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:prod]
module.alarm-trigger.aws_iam_policy.throwtrash-alarm-trigger-lambda-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-trigger-lambda-policy]
module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:dev]
module.api.aws_lambda_function.throwtrash-alarm-create-lambda: Refreshing state... [id=throwtrash-alarm-create]
module.api.aws_lambda_function.throwtrash-alarm-update-lambda: Refreshing state... [id=throwtrash-alarm-update]
module.api.aws_iam_role_policy_attachment.scheduler-policy-attachment: Refreshing state... [id=throwtrash-alarm-scheduler-role-20240429131751028900000001]
module.alarm-trigger.aws_iam_role_policy_attachment.lambda-policy-attachment: Refreshing state... [id=throwtrash-alarm-trigger-lambda-role-20240429131751105100000002]
module.delete-failed-alarms.aws_iam_policy.throwtrash-alarm-delete-lambda-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-delete-failed-alarms-lambda-policy]
module.delete-failed-alarms.aws_lambda_event_source_mapping.sqs_event_source: Refreshing state... [id=4f0a182a-c8c3-4074-b237-de8d92a46774]
module.delete-failed-alarms.aws_iam_role_policy_attachment.lambda-policy-attachment: Refreshing state... [id=throwtrash-alarm-delete-failed-alarms-lambda-role-20250127153930440600000001]
module.api.aws_lambda_alias.throwtrash-create-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:dev]
module.api.aws_api_gateway_integration.api-integration-create: Refreshing state... [id=agi-ylt5sxzsod-wipuw0-POST]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-create-alias-v2: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:v2]
module.api.aws_lambda_alias.throwtrash-update-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:dev]
module.api.aws_api_gateway_integration.api-integration-update: Refreshing state... [id=agi-ylt5sxzsod-k5ktnr-PUT]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-update-alias-v2: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:v2]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-create-permission-apigw-v2: Refreshing state... [id=terraform-20260301070555190300000003]
module.api.aws_lambda_permission.throwtrash-create-permission-apigw: Refreshing state... [id=terraform-20240429132817896500000004]
module.api.aws_lambda_permission.throwtrash-update-permission-apigw: Refreshing state... [id=terraform-20240429132827320000000006]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-update-permission-apigw-v2: Refreshing state... [id=terraform-20260301070546808500000002]
module.api.aws_api_gateway_deployment.api-deployment-dev: Refreshing state... [id=78em6t]
module.api.aws_api_gateway_stage.api-stage-dev: Refreshing state... [id=ags-ylt5sxzsod-dev]
module.api.aws_api_gateway_usage_plan.usage-plan-dev: Refreshing state... [id=4hwsh7]
module.api.aws_api_gateway_usage_plan_key.api-plan-key-dev: Refreshing state... [id=mtw89qlbs2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-prod[0] will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-trigger-prod" {
      ~ function_version = "20" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:prod"
        name             = "prod"
        # (4 unchanged attributes hidden)
    }

  # module.alarm-trigger.aws_lambda_function.throwtrash-alarm-trigger-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-trigger-lambda" {
        id                             = "throwtrash-alarm-trigger"
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-trigger-libs:2",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:20" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:20/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "20" -> (known after apply)
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.alarm-trigger.aws_lambda_layer_version.throwtrash-alarm-trigger-layer must be replaced
-/+ resource "aws_lambda_layer_version" "throwtrash-alarm-trigger-layer" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-trigger-libs:2" -> (known after apply)
      ~ code_sha256                 = "EwF+dEl9Kw5Q9NmYW3MdvmYENGMBNXs7dXRkC6/KG0w=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-03-08T13:58:20.287+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-trigger-libs:2" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-trigger-libs" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "EwF+dEl9Kw5Q9NmYW3MdvmYENGMBNXs7dXRkC6/KG0w=" -> "ySkxoCr1i9OpeLkY3j6sWWr0qScwUQPLjg7HTtf6dgU=" # forces replacement
      ~ source_code_size            = 31841888 -> (known after apply)
      ~ version                     = "2" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-create-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-create-lambda" {
        id                             = "throwtrash-alarm-create"
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-create-libs:2",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:19" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:19/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "19" -> (known after apply)
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-delete-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-delete-lambda" {
        id                             = "throwtrash-alarm-delete"
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-delete-libs:2",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:20" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:20/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "20" -> (known after apply)
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-update-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-update-lambda" {
        id                             = "throwtrash-alarm-update"
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-update-libs:2",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:19" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:19/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "19" -> (known after apply)
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_layer_version.throwtrash-alarm-create-layer must be replaced
-/+ resource "aws_lambda_layer_version" "throwtrash-alarm-create-layer" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-create-libs:2" -> (known after apply)
      ~ code_sha256                 = "KKTuZSevMD+MzZ4dgkOg1IthCp+01Cejow+GVDwRNG4=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-03-08T13:58:04.632+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-create-libs:2" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-create-libs" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "KKTuZSevMD+MzZ4dgkOg1IthCp+01Cejow+GVDwRNG4=" -> "gwxB1jFSjnSVo9CTTwcVSulneYpYOTmaMN+/PAz6nXM=" # forces replacement
      ~ source_code_size            = 17045568 -> (known after apply)
      ~ version                     = "2" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_lambda_layer_version.throwtrash-alarm-delete-layer must be replaced
-/+ resource "aws_lambda_layer_version" "throwtrash-alarm-delete-layer" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-delete-libs:2" -> (known after apply)
      ~ code_sha256                 = "9Fi3/zpY+Om+o/xdULLo+z3fMg/KbtWwfEM2b2gpdsU=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-03-08T13:57:53.594+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-delete-libs:2" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-delete-libs" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "9Fi3/zpY+Om+o/xdULLo+z3fMg/KbtWwfEM2b2gpdsU=" -> "cb0L4CbA77rY9WJGnwpyeVFlxAlc1An7fg0JRvBGiTk=" # forces replacement
      ~ source_code_size            = 17048279 -> (known after apply)
      ~ version                     = "2" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_lambda_layer_version.throwtrash-alarm-update-layer must be replaced
-/+ resource "aws_lambda_layer_version" "throwtrash-alarm-update-layer" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-update-libs:2" -> (known after apply)
      ~ code_sha256                 = "mkFxgl2wWbgByInHZfdbRcbrX0jp5fBgTIVEdAKaPhk=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-03-08T13:58:28.860+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-update-libs:2" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-update-libs" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "mkFxgl2wWbgByInHZfdbRcbrX0jp5fBgTIVEdAKaPhk=" -> "9h2sDTf8AQvMNIHZOHdQ8CW4FawFHdExG6AYnoZTJ/k=" # forces replacement
      ~ source_code_size            = 17048762 -> (known after apply)
      ~ version                     = "2" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.api-gateway-prod-stage[0].aws_api_gateway_base_path_mapping.api-base-path-mapping-v1 will be created
  + resource "aws_api_gateway_base_path_mapping" "api-base-path-mapping-v1" {
      + api_id      = "ylt5sxzsod"
      + base_path   = "v1"
      + domain_name = "alarm.mythrowaway.net"
      + id          = (known after apply)
      + stage_name  = "v1"
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-create-alias-v2 will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-create-alias-v2" {
      ~ function_version = "19" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:v2"
        name             = "v2"
        # (4 unchanged attributes hidden)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-delete-alias-v2 will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-delete-alias-v2" {
      ~ function_version = "20" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:v2"
        name             = "v2"
        # (4 unchanged attributes hidden)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-update-alias-v2 will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-update-alias-v2" {
      ~ function_version = "19" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:v2"
        name             = "v2"
        # (4 unchanged attributes hidden)
    }

  # module.delete-failed-alarms.aws_lambda_function.throwtrash-alarm-delete-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-delete-lambda" {
        id                             = "throwtrash-alarm-delete-failed-alarms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-delete-failed-alarms-libs:2",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete-failed-alarms:4" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete-failed-alarms:4/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "4" -> (known after apply)
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.delete-failed-alarms.aws_lambda_layer_version.throwtrash-alarm-delete-failed-alarms-layer must be replaced
-/+ resource "aws_lambda_layer_version" "throwtrash-alarm-delete-failed-alarms-layer" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-delete-failed-alarms-libs:2" -> (known after apply)
      ~ code_sha256                 = "hJHXC1qijr8/okF8JeB79YVNFTXR/iu37IWm0WuPjt8=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-03-08T13:57:42.007+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-delete-failed-alarms-libs:2" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-delete-failed-alarms-libs" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "hJHXC1qijr8/okF8JeB79YVNFTXR/iu37IWm0WuPjt8=" -> "8oFAJ1uYcRAPLj/gMbDU/A5DtK540RKdT5/Nv5ySykE=" # forces replacement
      ~ source_code_size            = 31845189 -> (known after apply)
      ~ version                     = "2" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 6 to add, 9 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
stdout<<ghadelimiter_64942776-4fdc-4e8c-8409-9550a71a5b89
module.api.data.archive_file.delete-function-zip: Reading...
module.api.data.archive_file.update-function-zip: Reading...
module.api.data.archive_file.update-layer-zip: Reading...
module.alarm-trigger.data.archive_file.trigger-function-zip: Reading...
module.api.data.archive_file.create-function-zip: Reading...
module.delete-failed-alarms.data.archive_file.delete-failed-alarms-function-zip: Reading...
module.api.data.archive_file.update-function-zip: Read complete after 0s [id=7e213fd57809e97b0c83eb4f2e2c0433c4fd7bb8]
module.api.data.archive_file.delete-function-zip: Read complete after 0s [id=f68ff486434550fb419471c943d13980b1d106ff]
module.delete-failed-alarms.data.archive_file.delete-failed-alarms-layer-zip: Reading...
module.alarm-trigger.data.archive_file.trigger-function-zip: Read complete after 0s [id=626b43679f3a6a90bf658a99bed3634aef175599]
module.alarm-trigger.data.archive_file.trigger-layer-zip: Reading...
module.delete-failed-alarms.data.archive_file.delete-failed-alarms-function-zip: Read complete after 0s [id=43bf908c2c33b6d87bec27329d1f19fc11a3a181]
module.api.data.archive_file.create-function-zip: Read complete after 0s [id=551ee35b11285d9e6532389d3cd18eca04a7c8ec]
module.api.data.archive_file.delete-layer-zip: Reading...
module.api.data.archive_file.create-layer-zip: Reading...
module.api.aws_scheduler_schedule_group.throwtrash-alarm-schedule-group: Refreshing state... [id=throwtrash-alarm-schedule-group]
module.delete-failed-alarms.aws_cloudwatch_log_group.throwtrash-alarm-delete-log-group: Refreshing state... [id=/aws/lambda/throwtrash-alarm-delete-failed-alarms]
module.api.data.aws_caller_identity.current: Reading...
module.api.aws_api_gateway_api_key.api-key-dev: Refreshing state... [id=mtw89qlbs2]
module.api.aws_dynamodb_table.throwtrash-alarm-table: Refreshing state... [id=throwtrash-alarm]
module.api.data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
module.api.aws_cloudwatch_log_group.throwtrash-alarm-log-group: Refreshing state... [id=/aws/lambda/throwtrash-alarm]
module.api-gateway-prod-stage[0].aws_api_gateway_api_key.api-key-prod-v2: Refreshing state... [id=hiry9xjdzl]
module.alarm-trigger.aws_cloudwatch_log_group.throwtrash-alarm-trigger-log-group: Refreshing state... [id=/aws/lambda/throwtrash-alarm-trigger]
module.api-gateway-prod-stage[0].aws_api_gateway_domain_name.api-domain-name: Refreshing state... [id=alarm.mythrowaway.net]
data.aws_caller_identity.current: Reading...
module.alarm-trigger.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.alarm-trigger.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.delete-failed-alarms.aws_sqs_queue.alarm_delete_queue_deadletter: Refreshing state... [id=https://sqs.ap-northeast-1.amazonaws.com/188970983837/throwtrash-alarm-delete-failed-alarms-queue-deadletter]
data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
module.api-gateway-prod-stage[0].aws_api_gateway_api_key.api-key-prod-v1: Refreshing state... [id=4rkujey9ml]
module.delete-failed-alarms.data.aws_caller_identity.current: Reading...
module.alarm-trigger.data.aws_caller_identity.current: Reading...
module.delete-failed-alarms.data.aws_region.current: Reading...
module.delete-failed-alarms.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.api.aws_api_gateway_rest_api.api: Refreshing state... [id=ylt5sxzsod]
module.delete-failed-alarms.data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
module.alarm-trigger.data.aws_region.current: Reading...
module.alarm-trigger.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.api.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.api.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.api.data.aws_iam_policy_document.scheduler-assume-role-policy: Reading...
module.api.data.aws_iam_policy_document.scheduler-assume-role-policy: Read complete after 0s [id=52247394]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.api.data.aws_region.current: Reading...
module.api.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.delete-failed-alarms.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.delete-failed-alarms.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.api-gateway-prod-stage[0].aws_route53_record.route53-record: Refreshing state... [id=Z5UYE2IX50J9A_alarm.mythrowaway.net_A]
module.alarm-trigger.aws_iam_role.throwtrash-alarm-trigger-lambda-role: Refreshing state... [id=throwtrash-alarm-trigger-lambda-role]
module.alarm-trigger.data.aws_caller_identity.current: Read complete after 1s [id=188970983837]
module.api.aws_iam_role.throwtrash-alarm-lambda-role: Refreshing state... [id=throwtrash-alarm-lambda-role]
module.api.aws_iam_role.throwtrash-alarm-scheduler-role: Refreshing state... [id=throwtrash-alarm-scheduler-role]
module.delete-failed-alarms.aws_iam_role.throwtrash-alarm-delete-lambda-role: Refreshing state... [id=throwtrash-alarm-delete-failed-alarms-lambda-role]
module.api.aws_iam_policy.throwtrash-alarm-lambda-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-lambda-policy]
module.api.aws_api_gateway_resource.api-resource-delete: Refreshing state... [id=nkks0s]
module.api.aws_api_gateway_resource.api-resource-update: Refreshing state... [id=k5ktnr]
module.api.aws_api_gateway_resource.api-resource-create: Refreshing state... [id=wipuw0]
module.api.aws_iam_role_policy_attachment.lambda-policy-attachment: Refreshing state... [id=throwtrash-alarm-lambda-role-20240429132809078300000002]
module.api.aws_api_gateway_method.api-method-delete: Refreshing state... [id=agm-ylt5sxzsod-nkks0s-DELETE]
module.api.aws_api_gateway_method.api-method-put: Refreshing state... [id=agm-ylt5sxzsod-k5ktnr-PUT]
module.api.aws_api_gateway_method.api-method-post: Refreshing state... [id=agm-ylt5sxzsod-wipuw0-POST]
module.delete-failed-alarms.aws_sqs_queue.alarm_delete_queue: Refreshing state... [id=https://sqs.ap-northeast-1.amazonaws.com/188970983837/throwtrash-alarm-delete-failed-alarms-queue]
module.api-gateway-prod-stage[0].aws_api_gateway_deployment.api-deployment-prod: Refreshing state... [id=uuaip0]
module.api-gateway-prod-stage[0].aws_api_gateway_stage.api-stage-prod-v1: Refreshing state... [id=ags-ylt5sxzsod-v1]
module.api-gateway-prod-stage[0].aws_api_gateway_stage.api-stage-prod-v2: Refreshing state... [id=ags-ylt5sxzsod-v2]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-update-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:v1]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan.usage-plan-prod-v1: Refreshing state... [id=u56dai]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-create-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:v1]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-delete-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:v1]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan.usage-plan-prod-v2: Refreshing state... [id=78fkm7]
module.api.data.archive_file.update-layer-zip: Read complete after 4s [id=60f5eaf000471a8de4f5fb20eac3033ce51d2915]
module.api-gateway-prod-stage[0].aws_api_gateway_base_path_mapping.api-base-path-mapping-v2: Refreshing state... [id=alarm.mythrowaway.net/v2]
module.api.data.archive_file.create-layer-zip: Read complete after 4s [id=ef067e6028eaa7c30183236c033be99cf3b80fc7]
module.api.aws_lambda_layer_version.throwtrash-alarm-update-layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-update-libs:2]
module.api.aws_lambda_layer_version.throwtrash-alarm-create-layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-create-libs:2]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan_key.api-plan-key-prod-v1: Refreshing state... [id=4rkujey9ml]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan_key.api-plan-key-prod-v2: Refreshing state... [id=hiry9xjdzl]
module.api.data.archive_file.delete-layer-zip: Read complete after 4s [id=84a56c1422bc2349fe9f31579b14f29a11ac9475]
module.api.aws_lambda_layer_version.throwtrash-alarm-delete-layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-delete-libs:2]
module.api.aws_lambda_function.throwtrash-alarm-delete-lambda: Refreshing state... [id=throwtrash-alarm-delete]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-create-permission-apigw-v1: Refreshing state... [id=terraform-20240502175439018500000002]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-update-permission-apigw-v1: Refreshing state... [id=terraform-20240502175439070600000003]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-delete-permission-apigw-v1: Refreshing state... [id=terraform-20240502175438382900000001]
module.api.aws_api_gateway_integration.api-integration-delete: Refreshing state... [id=agi-ylt5sxzsod-nkks0s-DELETE]
module.api.aws_lambda_alias.throwtrash-delete-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:dev]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-delete-alias-v2: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:v2]
module.alarm-trigger.data.archive_file.trigger-layer-zip: Read complete after 6s [id=d3ad43534801267fa5f4596b2a796e7b6d6637c5]
module.alarm-trigger.aws_lambda_layer_version.throwtrash-alarm-trigger-layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-trigger-libs:2]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-delete-permission-apigw-v2: Refreshing state... [id=terraform-20260301070524801500000001]
module.api.aws_lambda_permission.throwtrash-delete-permission-apigw: Refreshing state... [id=terraform-20240429131802029300000004]
module.delete-failed-alarms.data.archive_file.delete-failed-alarms-layer-zip: Read complete after 6s [id=ddd3d57063b5858c53222eb2ee15f98f8addfb6d]
module.delete-failed-alarms.aws_lambda_layer_version.throwtrash-alarm-delete-failed-alarms-layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-delete-failed-alarms-libs:2]
module.alarm-trigger.aws_lambda_function.throwtrash-alarm-trigger-lambda: Refreshing state... [id=throwtrash-alarm-trigger]
module.delete-failed-alarms.aws_lambda_function.throwtrash-alarm-delete-lambda: Refreshing state... [id=throwtrash-alarm-delete-failed-alarms]
module.api.aws_iam_policy.throwtrash-alarm-scheduler-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-scheduler-policy]
module.alarm-trigger.aws_lambda_function_event_invoke_config.throwtrash-alarm-trigger-lambda-event-invoke-config: Refreshing state... [id=throwtrash-alarm-trigger]
module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-prod[0]: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:prod]
module.alarm-trigger.aws_iam_policy.throwtrash-alarm-trigger-lambda-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-trigger-lambda-policy]
module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:dev]
module.api.aws_lambda_function.throwtrash-alarm-create-lambda: Refreshing state... [id=throwtrash-alarm-create]
module.api.aws_lambda_function.throwtrash-alarm-update-lambda: Refreshing state... [id=throwtrash-alarm-update]
module.api.aws_iam_role_policy_attachment.scheduler-policy-attachment: Refreshing state... [id=throwtrash-alarm-scheduler-role-20240429131751028900000001]
module.alarm-trigger.aws_iam_role_policy_attachment.lambda-policy-attachment: Refreshing state... [id=throwtrash-alarm-trigger-lambda-role-20240429131751105100000002]
module.delete-failed-alarms.aws_iam_policy.throwtrash-alarm-delete-lambda-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-delete-failed-alarms-lambda-policy]
module.delete-failed-alarms.aws_lambda_event_source_mapping.sqs_event_source: Refreshing state... [id=4f0a182a-c8c3-4074-b237-de8d92a46774]
module.delete-failed-alarms.aws_iam_role_policy_attachment.lambda-policy-attachment: Refreshing state... [id=throwtrash-alarm-delete-failed-alarms-lambda-role-20250127153930440600000001]
module.api.aws_lambda_alias.throwtrash-create-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:dev]
module.api.aws_api_gateway_integration.api-integration-create: Refreshing state... [id=agi-ylt5sxzsod-wipuw0-POST]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-create-alias-v2: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:v2]
module.api.aws_lambda_alias.throwtrash-update-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:dev]
module.api.aws_api_gateway_integration.api-integration-update: Refreshing state... [id=agi-ylt5sxzsod-k5ktnr-PUT]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-update-alias-v2: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:v2]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-create-permission-apigw-v2: Refreshing state... [id=terraform-20260301070555190300000003]
module.api.aws_lambda_permission.throwtrash-create-permission-apigw: Refreshing state... [id=terraform-20240429132817896500000004]
module.api.aws_lambda_permission.throwtrash-update-permission-apigw: Refreshing state... [id=terraform-20240429132827320000000006]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-update-permission-apigw-v2: Refreshing state... [id=terraform-20260301070546808500000002]
module.api.aws_api_gateway_deployment.api-deployment-dev: Refreshing state... [id=78em6t]
module.api.aws_api_gateway_stage.api-stage-dev: Refreshing state... [id=ags-ylt5sxzsod-dev]
module.api.aws_api_gateway_usage_plan.usage-plan-dev: Refreshing state... [id=4hwsh7]
module.api.aws_api_gateway_usage_plan_key.api-plan-key-dev: Refreshing state... [id=mtw89qlbs2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-prod[0] will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-trigger-prod" {
      ~ function_version = "20" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:prod"
        name             = "prod"
        # (4 unchanged attributes hidden)
    }

  # module.alarm-trigger.aws_lambda_function.throwtrash-alarm-trigger-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-trigger-lambda" {
        id                             = "throwtrash-alarm-trigger"
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-trigger-libs:2",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:20" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:20/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "20" -> (known after apply)
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.alarm-trigger.aws_lambda_layer_version.throwtrash-alarm-trigger-layer must be replaced
-/+ resource "aws_lambda_layer_version" "throwtrash-alarm-trigger-layer" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-trigger-libs:2" -> (known after apply)
      ~ code_sha256                 = "EwF+dEl9Kw5Q9NmYW3MdvmYENGMBNXs7dXRkC6/KG0w=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-03-08T13:58:20.287+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-trigger-libs:2" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-trigger-libs" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "EwF+dEl9Kw5Q9NmYW3MdvmYENGMBNXs7dXRkC6/KG0w=" -> "ySkxoCr1i9OpeLkY3j6sWWr0qScwUQPLjg7HTtf6dgU=" # forces replacement
      ~ source_code_size            = 31841888 -> (known after apply)
      ~ version                     = "2" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-create-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-create-lambda" {
        id                             = "throwtrash-alarm-create"
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-create-libs:2",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:19" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:19/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "19" -> (known after apply)
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-delete-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-delete-lambda" {
        id                             = "throwtrash-alarm-delete"
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-delete-libs:2",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:20" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:20/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "20" -> (known after apply)
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-update-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-update-lambda" {
        id                             = "throwtrash-alarm-update"
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-update-libs:2",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:19" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:19/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "19" -> (known after apply)
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_layer_version.throwtrash-alarm-create-layer must be replaced
-/+ resource "aws_lambda_layer_version" "throwtrash-alarm-create-layer" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-create-libs:2" -> (known after apply)
      ~ code_sha256                 = "KKTuZSevMD+MzZ4dgkOg1IthCp+01Cejow+GVDwRNG4=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-03-08T13:58:04.632+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-create-libs:2" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-create-libs" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "KKTuZSevMD+MzZ4dgkOg1IthCp+01Cejow+GVDwRNG4=" -> "gwxB1jFSjnSVo9CTTwcVSulneYpYOTmaMN+/PAz6nXM=" # forces replacement
      ~ source_code_size            = 17045568 -> (known after apply)
      ~ version                     = "2" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_lambda_layer_version.throwtrash-alarm-delete-layer must be replaced
-/+ resource "aws_lambda_layer_version" "throwtrash-alarm-delete-layer" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-delete-libs:2" -> (known after apply)
      ~ code_sha256                 = "9Fi3/zpY+Om+o/xdULLo+z3fMg/KbtWwfEM2b2gpdsU=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-03-08T13:57:53.594+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-delete-libs:2" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-delete-libs" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "9Fi3/zpY+Om+o/xdULLo+z3fMg/KbtWwfEM2b2gpdsU=" -> "cb0L4CbA77rY9WJGnwpyeVFlxAlc1An7fg0JRvBGiTk=" # forces replacement
      ~ source_code_size            = 17048279 -> (known after apply)
      ~ version                     = "2" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_lambda_layer_version.throwtrash-alarm-update-layer must be replaced
-/+ resource "aws_lambda_layer_version" "throwtrash-alarm-update-layer" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-update-libs:2" -> (known after apply)
      ~ code_sha256                 = "mkFxgl2wWbgByInHZfdbRcbrX0jp5fBgTIVEdAKaPhk=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-03-08T13:58:28.860+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-update-libs:2" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-update-libs" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "mkFxgl2wWbgByInHZfdbRcbrX0jp5fBgTIVEdAKaPhk=" -> "9h2sDTf8AQvMNIHZOHdQ8CW4FawFHdExG6AYnoZTJ/k=" # forces replacement
      ~ source_code_size            = 17048762 -> (known after apply)
      ~ version                     = "2" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.api-gateway-prod-stage[0].aws_api_gateway_base_path_mapping.api-base-path-mapping-v1 will be created
  + resource "aws_api_gateway_base_path_mapping" "api-base-path-mapping-v1" {
      + api_id      = "ylt5sxzsod"
      + base_path   = "v1"
      + domain_name = "alarm.mythrowaway.net"
      + id          = (known after apply)
      + stage_name  = "v1"
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-create-alias-v2 will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-create-alias-v2" {
      ~ function_version = "19" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:v2"
        name             = "v2"
        # (4 unchanged attributes hidden)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-delete-alias-v2 will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-delete-alias-v2" {
      ~ function_version = "20" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:v2"
        name             = "v2"
        # (4 unchanged attributes hidden)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-update-alias-v2 will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-update-alias-v2" {
      ~ function_version = "19" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:v2"
        name             = "v2"
        # (4 unchanged attributes hidden)
    }

  # module.delete-failed-alarms.aws_lambda_function.throwtrash-alarm-delete-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-delete-lambda" {
        id                             = "throwtrash-alarm-delete-failed-alarms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-delete-failed-alarms-libs:2",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete-failed-alarms:4" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete-failed-alarms:4/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "4" -> (known after apply)
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.delete-failed-alarms.aws_lambda_layer_version.throwtrash-alarm-delete-failed-alarms-layer must be replaced
-/+ resource "aws_lambda_layer_version" "throwtrash-alarm-delete-failed-alarms-layer" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-delete-failed-alarms-libs:2" -> (known after apply)
      ~ code_sha256                 = "hJHXC1qijr8/okF8JeB79YVNFTXR/iu37IWm0WuPjt8=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-03-08T13:57:42.007+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-delete-failed-alarms-libs:2" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-delete-failed-alarms-libs" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "hJHXC1qijr8/okF8JeB79YVNFTXR/iu37IWm0WuPjt8=" -> "8oFAJ1uYcRAPLj/gMbDU/A5DtK540RKdT5/Nv5ySykE=" # forces replacement
      ~ source_code_size            = 31845189 -> (known after apply)
      ~ version                     = "2" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 6 to add, 9 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

ghadelimiter_64942776-4fdc-4e8c-8409-9550a71a5b89
stderr<<ghadelimiter_998d3d31-fc4a-480f-9252-ee8d4662383e

ghadelimiter_998d3d31-fc4a-480f-9252-ee8d4662383e
exitcode<<ghadelimiter_72d2184c-4089-4898-b6ee-1a59714fab64
0
ghadelimiter_72d2184c-4089-4898-b6ee-1a59714fab64
```